In [1]:
import pandas as pd
import numpy as np

In [ ]:
# limpeza de dados - isna, notna, duplicated

In [2]:
df = pd.DataFrame({
'ord_no':[70001,70006,70002,70004,70007,70005,70008,70010,70003,70011,70009,70012],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})

In [ ]:
df

In [ ]:
# isna mostra uma copia do dataframe com a resposta booleana 
df.isna()

In [3]:
# isna.any mostra uma Series com a resposta booleana agregada da coluna (se tiver ao menos um valor nan ele retorna True)
df.isna().any()
# isna.all mostra uma Series com a resposta booleana agregada da coluna (ele só retorna True se todos os valores forem NaN)
df.isna().all()
df['nan_test'] = None
df.isna().all()
# isna.sum() mostra uma Series com a conta de quantos valores NaN temos em cada coluna do Dataframe
print(df.isna().sum())
# sum duas veces traz o valor total do dataframe
df.isna().sum().sum()

ord_no          0
purch_amt       0
ord_date        1
customer_id     0
salesman_id     3
nan_test       12
dtype: int64

16

In [4]:
#Criamos uma coluna com valores teste, atenção na diferencia entre None e np.nan, também se a nossa serie é menor veja o que acontece
df['othervalue_test'] = pd.Series([12,9,None,'--','*',9,np.nan,100,'--'])
df

,ord_no,purch_amt,ord_date,customer_id,salesman_id,nan_test,othervalue_test
0,70001,150.50,2012-10-05,3002,5002.0,None,12
1,70006,270.65,2012-09-10,3001,5003.0,None,9
2,70002,65.26,NaN,3001,5001.0,None,None
3,70004,110.50,2012-08-17,3003,NaN,None,--
4,70007,948.50,2012-09-10,3002,5002.0,None,*
5,70005,2400.60,2012-07-27,3001,5001.0,None,9
6,70008,5760.00,2012-09-10,3001,5001.0,None,NaN
7,70010,1983.43,2012-10-10,3004,NaN,None,100
8,70003,2480.40,2012-10-10,3003,5003.0,None,--
9,70011,250.45,2012-06-27,3002,5002.0,None,NaN
10,70009,75.29,2012-08-17,3001,5003.0,None,NaN
11,70012,3045.60,2012-04-25,3001,NaN,None,NaN

In [ ]:
df.info()

In [ ]:
#notna - Mostra uma Series com a conta contraria do isna
df.notna().sum()

In [5]:
#replace conseguimos trocar todos os valores do nosso dataframe, utilizando o formato de dict
df_replaced = df.replace({"*": np.nan, "--": np.nan, None:np.nan})
df_replaced

,ord_no,purch_amt,ord_date,customer_id,salesman_id,nan_test,othervalue_test
0,70001,150.50,2012-10-05,3002,5002.0,NaN,12.0
1,70006,270.65,2012-09-10,3001,5003.0,NaN,9.0
2,70002,65.26,NaN,3001,5001.0,NaN,NaN
3,70004,110.50,2012-08-17,3003,NaN,NaN,NaN
4,70007,948.50,2012-09-10,3002,5002.0,NaN,NaN
5,70005,2400.60,2012-07-27,3001,5001.0,NaN,9.0
6,70008,5760.00,2012-09-10,3001,5001.0,NaN,NaN
7,70010,1983.43,2012-10-10,3004,NaN,NaN,100.0
8,70003,2480.40,2012-10-10,3003,5003.0,NaN,NaN
9,70011,250.45,2012-06-27,3002,5002.0,NaN,NaN
10,70009,75.29,2012-08-17,3001,5003.0,NaN,NaN
11,70012,3045.60,2012-04-25,3001,NaN,NaN,NaN

In [ ]:
#Observe como a nossa coluna se transformou em dtype float
df_replaced.info()

OBSERVAÇÃO
>**None** - é um Python type que não deve ser usado matematicamente ele vale mais como um valor não existente ou vazio<br>
>**NaN** - é um valor que é utilizado para representar um valor numericamente invalido ele é considerado como float

In [6]:
df_replaced['customer_id']

0     3002
1     3001
2     3001
3     3003
4     3002
5     3001
6     3001
7     3004
8     3003
9     3002
10    3001
11    3001
Name: customer_id, dtype: int64

In [7]:
# duplicated - Mostra uma Series com a verificação se tem valores duplicados
# subset - para escolher qual coluna
# keep - first=coloca True apos a primeira ocorrencia / last-coloca True desde a primeira aparição e False na ultma ocorrencia da serie
df_replaced.duplicated(subset=['customer_id'],keep='last')

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7     False
8     False
9     False
10     True
11    False
dtype: bool

In [ ]:
df_replaced

In [ ]:
# droping values - drop, dropna, drop_duplicates

In [8]:
#drop - da um drop na coluna ou colunas especificada
df_replaced.drop(columns=['nan_test','othervalue_test'])

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3002       5002.0
1    70006     270.65  2012-09-10         3001       5003.0
2    70002      65.26         NaN         3001       5001.0
3    70004     110.50  2012-08-17         3003          NaN
4    70007     948.50  2012-09-10         3002       5002.0
5    70005    2400.60  2012-07-27         3001       5001.0
6    70008    5760.00  2012-09-10         3001       5001.0
7    70010    1983.43  2012-10-10         3004          NaN
8    70003    2480.40  2012-10-10         3003       5003.0
9    70011     250.45  2012-06-27         3002       5002.0
10   70009      75.29  2012-08-17         3001       5003.0
11   70012    3045.60  2012-04-25         3001          NaN

In [9]:
#dropna - da um drop em colunas ou linhas, se não especificar dropa linha ou coluna se tiver ao menos um na value / default axis=0
df_replaced.dropna(axis=1)

    ord_no  purch_amt  customer_id
0    70001     150.50         3002
1    70006     270.65         3001
2    70002      65.26         3001
3    70004     110.50         3003
4    70007     948.50         3002
5    70005    2400.60         3001
6    70008    5760.00         3001
7    70010    1983.43         3004
8    70003    2480.40         3003
9    70011     250.45         3002
10   70009      75.29         3001
11   70012    3045.60         3001

In [10]:
#drop_duplicates, T (Transpose) - Muda a orientação do Dataframe
df_temp = pd.DataFrame(df_replaced.iloc[9,:]).T
df_temp

,ord_no,purch_amt,ord_date,customer_id,salesman_id,nan_test,othervalue_test
9,70011,250.45,2012-06-27,3002,5002.0,NaN,NaN

In [11]:
df_replaced = df_replaced.append(df_temp)
#falar do inplace (https://towardsdatascience.com/why-you-should-probably-never-use-pandas-inplace-true-9f9f211849e4#:~:text=Using%20the%20inplace%3DTrue%20keyword,which%20you%20apply%20it%20to.)
df_replaced = df_replaced.reset_index(drop=True)

C:\Users\minoru\AppData\Local\Temp\ipykernel_1856\377166696.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_replaced = df_replaced.append(df_temp)

In [ ]:
df_replaced

In [12]:
#drop_duplicates - faz um drop em qualquer linha que tiver todos os valores iguais, subset escolhe coluna, keep(last ou first)
df_replaced.drop_duplicates(subset=['customer_id'],keep='first')

,ord_no,purch_amt,ord_date,customer_id,salesman_id,nan_test,othervalue_test
0,70001,150.5,2012-10-05,3002,5002.0,NaN,12.0
1,70006,270.65,2012-09-10,3001,5003.0,NaN,9.0
3,70004,110.5,2012-08-17,3003,NaN,NaN,NaN
7,70010,1983.43,2012-10-10,3004,NaN,NaN,100.0

In [13]:
df_replaced = df_replaced.drop_duplicates()

In [16]:
df_replaced

,ord_no,purch_amt,ord_date,customer_id,salesman_id,nan_test,othervalue_test
0,70001,150.5,2012-10-05,3002,5002.0,NaN,12.0
1,70006,270.65,2012-09-10,3001,5003.0,NaN,9.0
2,70002,65.26,NaN,3001,5001.0,NaN,NaN
3,70004,110.5,2012-08-17,3003,NaN,NaN,NaN
4,70007,948.5,2012-09-10,3002,5002.0,NaN,NaN
5,70005,2400.6,2012-07-27,3001,5001.0,NaN,9.0
6,70008,5760.0,2012-09-10,3001,5001.0,NaN,NaN
7,70010,1983.43,2012-10-10,3004,NaN,NaN,100.0
8,70003,2480.4,2012-10-10,3003,5003.0,NaN,NaN
9,70011,250.45,2012-06-27,3002,5002.0,NaN,NaN
10,70009,75.29,2012-08-17,3001,5003.0,NaN,NaN
11,70012,3045.6,2012-04-25,3001,NaN,NaN,NaN

In [ ]:
# manipulação de dataframes - merge, concat, melt

In [14]:
#melt - transforma nosso dataframe para usos especificos id_vars escolhe qual é a nossa primera coluna e value_vars qual queremos mostrar
df_replaced.melt()

           variable  value
0            ord_no  70001
1            ord_no  70006
2            ord_no  70002
3            ord_no  70004
4            ord_no  70007
..              ...    ...
79  othervalue_test  100.0
80  othervalue_test    NaN
81  othervalue_test    NaN
82  othervalue_test    NaN
83  othervalue_test    NaN

[84 rows x 2 columns]

In [15]:
df_replaced.melt(id_vars='ord_no',value_vars='purch_amt')

   ord_no   variable    value
0   70001  purch_amt    150.5
1   70006  purch_amt   270.65
2   70002  purch_amt    65.26
3   70004  purch_amt    110.5
4   70007  purch_amt    948.5
5   70005  purch_amt   2400.6
6   70008  purch_amt   5760.0
7   70010  purch_amt  1983.43
8   70003  purch_amt   2480.4
9   70011  purch_amt   250.45
10  70009  purch_amt    75.29
11  70012  purch_amt   3045.6

>**Merge** - junta dois dataframes e podemos especificar como:
- em coluna especifica
- left(so nos valores que tiverem na coluna esquerda)
- right(so nos valores que tiverem na coluna direita)
- inner(so nos valores em comum nos dois dataframes)
- outer(tudo)

In [ ]:
df_clientes = pd.read_csv('customers.csv',sep=';')

In [ ]:
df_clientes

In [ ]:
df_replaced.merge(df_clientes,how='left',on=['ord_no'])

In [ ]:
#DIY - Grupos (Olist)

https://www.kaggle.com/datasets/olistbr/brazilian-ecommerce

1. Pegar os dados de products, orders,  customers,items
2. Explorar os dados e identificar as colunas em comum
3. Junte as colunas no seu dataframe de items necessarias para poder ver quais são as 10 categorias que mais trouxeram receita pra a empresa
4. Faça um groupby e descobra qual order_id teve mais produtos pedidos(um pedido pode ter mais de um item)
    - Procure por esse pedido no df de clientes(faça o merge)
    - De qual estado é o cliente?
5. No DF de orders crie uma nova coluna com o time delta entre a data estimada de entrega e a data real 
6. Analise a coluna e traga conclusões(
    - temos valores outliers?
    - quanto eles representam?
    - qual é a nossa media?
    - quanto representa nosso de nosso dataframe pedidos que demoraram mais de 5 dias para entregar apos a data prometida
7. Quantos estados temos no nosso dataset?, Tem todos os estados do Brasil?,Quais são os 3 estados com mais pedidos?
8. Bonus(Faça um gafico com essa informação)